---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegment.ValueString
source: html/8fc8a311-14e9-12a8-b56c-b277c2c776c0.htm
---
# Autodesk.Revit.DB.DimensionSegment.ValueString Property

The displayed value shown for the dimension segment.

## Syntax (C#)
```csharp
public string ValueString { get; }
```